data = {
    "opinionators": [
        {
            "name": "Jeb Bush",
            "title": "Presidential candidate",
            "img": "img/bush.png",
            "x": "63%",
            "y": "5px"
        },
        {
            "name": "Ted Cruz",
            "title": "Presidential candidate",
            "img": "img/cruz.png",
            "x": "0",
            "y": "6px"
        },
        {
            "name": "John Boehner",
            "title": "",
            "img": "img/boehner.png",
            "x": "-2px",
            "y": "10px"
        },
        {
            "name": "Ben Carson",
            "title": "",
            "img": "img/carson.png",
            "x": "28px",
            "y": "8px"
        },
        {
            "name": "Chris Christie",
            "title": "",
            "img": "img/christie.png",
            "x": "-18px",
            "y": "5px"
        },
        {
            "name": "Ted Cruz",
            "title": "",
            "img": "img/cruz.png"
        },
        {
            "name": "Carly Fiorina",
            "title": "",
            "img": "img/fiorina.png",
            "x": "8px",
            "y": "3px"
        },
        {
            "name": "Lindsey Graham",
            "title": "",
            "img": "img/graham.png",
            "x": "-11px",
            "y": "3px"
        },
        {
            "name": "Mike Huckabee",
            "title": "",
            "img": "img/huckabee.png",
            "x": "66%",
            "y": "6px"
        },
        {
            "name": "Jim Inhofe",
            "title": "",
            "img": "img/inhofe.png",
            "x": "-7px",
            "y": "8px"
        },
        {
            "name": "Bobby Jindal",
            "title": "",
            "img": "img/jindal.png",
            "x": "-6px",
            "y": "8px"
        },
        {
            "name": "John Kasich",
            "title": "",
            "img": "img/kasich.png",
            "x": "0",
            "y": "5px"
        },
        {
            "name": "Mitch McConnell",
            "title": "",
            "img": "img/mcconnell.png",
            "x": "-13px",
            "y": "10px"
        },
        {
            "name": "Sarah Palin",
            "title": "",
            "img": "img/palin.png",
            "x": "-22px",
            "y": "4px"
        },
        {
            "name": "Rand Paul",
            "title": "",
            "img": "img/paul.png",
            "x": "10px",
            "y": "6px"
        },
        {
            "name": "Rick Perry",
            "title": "",
            "img": "img/perry.png",
            "x": "-12px",
            "y": "5px"
        },
        {
            "name": "Mitt Romney",
            "title": "",
            "img": "img/romney.png",
            "x": "0px",
            "y": "5px"
        },
        {
            "name": "Marco Rubio",
            "title": "",
            "img": "img/rubio.png",
            "x": "-25%",
            "y": "3px"
        },
        {
            "name": "Rick Santorum",
            "title": "",
            "img": "img/santorum.png",
            "x": "-5px",
            "y": "9px"
        },
        {
            "name": "Scott Walker",
            "title": "",
            "img": "img/walker.png",
            "x": "0",
            "y": "6px"
        }
    ],
    "issues": [
        {
            "title": "",
            "text": "",
            "viewpoints": [
                {
                    "name": "Rand Paul",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>The Kentucky senator&rsquo;s stance is murky. In 2013, Paul filed an amendment to the Senate Gang of Eight bill called the &ldquo;No New Pathway to Citizenship Act,&rdquo; which would have replaced citizenship with work visas. </p><p>But he still seems to support at least some form of such a path. He has eschewed using the term &ldquo;pathway to citizenship,&rdquo; but says he supports &ldquo;probation&rdquo; followed by &ldquo;assimilation&rdquo;&mdash;in other words, putting undocumented immigrants on an eventual track to either permanent legal status (aka a green card) or full-on citizenship.</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>&ldquo;After ensuring border security, then I would normalize the status of the 11 million undocumented citizens so they can join the workforce and pay taxes,&rdquo; Paul said in a 2013 statement. &ldquo;I would normalize them at a rate of about 2 million per year. I would start with DREAM Act kids, children brought here illegally as minors. Normalization would get them a temporary visa but would not put them ahead of anyone already waiting to enter the country. These undocumented persons would now be documented but they would still have to wait in line like everyone else. But their path to permanent legal status would be no faster than those currently waiting in line.&rdquo;</p><p> </p><p>At an event in August with Rep. Steve King&mdash;a hard-liner on immigration&mdash;Paul appeared to literally run away from a DREAMer. Two days later, he was confronted again during a speech. &ldquo;I have sympathy for the DREAM Act kids. I&rsquo;m actually a moderate on immigration,&rdquo; Paul said.</p>",
                    "quote": {
                        "text": "I think the conversation needs to start by acknowledging that we aren't going to deport 12 million illegal immigrants. If you wish to live and work in America, then we will find a place for you.",
                        "dateline": "March 2013, speech"
                    }
                },
				{
                    "name": "Ted Cruz",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'negative'>No.</span></p><p>The Texas senator is pretty unequivocal. &quot;I think a path to citizenship for those who are here illegally is profoundly unfair to the millions of legal immigrants who followed the rules,&rdquo; Cruz told ABC in 2013. </p><p>Cruz has repeatedly referred to President Obama&rsquo;s executive order as &ldquo;lawless amnesty,&rdquo; and in 2013, he filed an amendment that would deny a pathway to citizenship to undocumented immigrants. However, Cruz has shown some vague support for a &ldquo;path to legal status,&rdquo; according to The New York Times. He has also proposed doubling the number of green cards given out each year.</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'negative'>No.</span></p><p>Cruz has opposed the DREAM Act, which would &ldquo;provide illegal immigrants who were brought to the United States as children a path to permanent residency if they attend college or serve in the military.&rdquo; In 2014, he unsuccessfully tried to reverse Obama&rsquo;s executive order to halt the deportation of young, undocumented immigrants.</p>",
                    "quote": {
                        "text": "Providing a path to citizenship undermines the rule of law and is an insult to the millions who have immigrated to the U.S. legally.",
                        "dateline": "June 2013, press release"
                    }
                },
				{
                    "name": "Jeb Bush",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'affirmative'>Yes.</span></p><p>According to Politifact, the former Florida governor flipped from favoring deportation for undocumented immigrants to favoring a path to citizenship &ldquo;sometime between 2009 and 2012.&rdquo; Since then, he has supported a path to citizenship.</p><p> </p><p>&ldquo;You have to deal with this issue,&rdquo; he told Charlie Rose in 2012. &ldquo;You can&rsquo;t ignore it, and so either a path to citizenship, which I would support&mdash;and that does put me probably out of the mainstream of most conservatives&mdash;or ... a path ... to residency of some kind.&rdquo;</p><p> </p><p>In April, Bush said there should be &ldquo;penalties for breaking the law&rdquo; but that coming to the United States illegally is often &ldquo;an act of love.&rdquo; More recently, top Republican donors have praised Bush for his stance on immigration. Spencer Zwick, the finance chair of Mitt Romney&rsquo;s 2012 presidential campaign, called immigration reform &ldquo;the path to winning a presidential campaign.&rdquo;</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'affirmative'>Yes.</span></p><p>In 2012, Bush told reporters he does not support Obama&rsquo;s executive actions on immigration, but does support the DREAM Act.</p><p> </p><p>&ldquo;Having a solution to the fact that we have all of these young people&mdash;many of whom are making great contributions, don&rsquo;t have a connection to their parents&rsquo; former country&mdash;yeah, of course I&rsquo;m for it,&rdquo; Bush said at the time. &ldquo;But then again, I&rsquo;m not running for anything, and I can speak my mind.&rdquo;</p>",
                    "quote": {
                        "text": "Having a solution to the fact that we have all of these young people&mdash;many of whom are making great contributions, don&rsquo;t have a connection to their parents&rsquo; former country&mdash;yeah, of course I&rsquo;m for it.  But then again, I&rsquo;m not running for anything, and I can speak my mind.",
                        "dateline": "August 2012, interview with reporters"
                    }
                },
				{
                    "name": "Marco Rubio",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>In 2010, the Florida senator said that an &ldquo;earned path to citizenship is basically code for amnesty.&rdquo; Two years later, however, Rubio became one of the members of the Gang of Eight and sponsored a bill that would have introduced a pathway to citizenship for undocumented immigrants (along with new border-security measures and a new visa system). The bill passed the Senate but went nowhere in the Republican-controlled House.</p><p>Since 2013, however, Rubio has backed away somewhat from a full pathway to citizenship, advocating instead for a &ldquo;piecemeal&rdquo; approach starting with border security.</span></strong> In his new book, American Dreams, Rubio proposes a three-step path to permanent residency (aka a green card) for undocumented immigrants: <ul><li>First, those here illegally must come forward and be registered. If they have committed serious crimes or have not been here long enough, they will have to leave. With the new E-Verify system in place, they are going to find it difficult to find a job in any case.&rdquo;</li><li>&ldquo;Second, those who qualify would be allowed to apply for a temporary nonimmigrant visa. To obtain it, they will have to pay an application fee and a fine, undergo a background check and learn English. Once they receive this work permit, they would be allowed to work legally and travel. To keep it, they will have to pay taxes. They would not qualify for government programs like Obamacare, welfare, or food stamps. And if they commit a crime while in this status, they would lose their permit.&rdquo;</li><li>&ldquo;Third and finally, those who qualify for a nonimmigrant visa will have to remain in this status for at least a decade. After that, they would be allowed to apply for permanent residency if they so choose. Many who choose to seek permanent residency would have to do it the way anyone else would, not through any special pathway.&rdquo;</li></ul><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>In 2012, Rubio reached out to immigration activists and introduced an alternative to the DREAM Act, which he called &ldquo;too broad.&rdquo; His replacement would have provided certain young undocumented immigrants with work visas, but not &ldquo;amnesty.&rdquo;</p><p> </p><p>&quot;After some period of time, probably 10 years, we would then allow them to access the immigration system just like any nonimmigrant visa holder in the United States would,&rdquo; Rubio told CBS at the time. &ldquo;So they'd be no worse off than anybody else, but no better off, either. No special path. Just the same path as everyone else.&rdquo; His proposal became effectively redundant, however, with the introduction of Obama&rsquo;s 2012 executive order.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Bobby Jindal",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'affirmative'>Yes.</span></p><p>In 2007, the Louisiana governor appeared much more of an immigration hard-liner than he is today. As a member of Congress, he cosponsored a bill introduced by Rep. Steve King that would have declared English the official language of the United States. And in 2010, Jindal criticized people who &quot;think we should open up our borders and grant amnesty to millions of illegals who broke the law when they crossed the border.&quot;</p><p> </p><p>But three years later, in an op-ed opposing the 2013 immigration-reform bill, Jindal&rsquo;s tone visibly softened. He now supports a pathway to legal status and eventual citizenship, but only after addressing border-security concerns, he says.</p><p> </p><p>&ldquo;As the son of immigrants to this country, and as a student of American history, I&rsquo;m an unapologetic advocate for immigration,&rdquo; he wrote in National Review in 2013. &ldquo;As for a pathway to citizenship: For folks who came here illegally but are willing to gain proficiency in English, pay a fine, and demonstrate a willingness to assimilate, we should require them to work here and pay taxes for a substantial period of time after obtaining legal status before they have the opportunity to begin the process of applying for U.S. citizenship.&rdquo;</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>Jindal does not have a clear stance on the details of the DREAM Act. But, like many of his Republican cohort, Jindal has opposed Obama&rsquo;s executive order giving protection to young undocumented immigrants. In 2012, Jindal said he supported a comprehensive immigration bill, but would not grant temporary amnesty to young undocumented immigrants until that bill was passed.</p><p> </p><p>&ldquo;We can&rsquo;t do this piecemeal,&rdquo; he said at the time. &ldquo;We can&rsquo;t do this little piece by little piece.&rdquo;</p><p> </p><p>Two years later, Jindal said he was opposed to punishing DREAMers. &ldquo;I don't think we're the kind of people who are going to kick people out of schools or hospitals or punish kids for what their parents have done,&rdquo; Jindal told CNN in 2014.</p><p> </p><p>&ldquo;The governor opposes in-state tuition for illegal immigrants,&rdquo; a spokesperson for Jindal&rsquo;s office told National Journal.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Ben Carson",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>Carson, a neurosurgeon and darling of conservatives, has not directly said if he supports a pathway to citizenship, but in his book America The Beautiful, Carson seemed to imply that a pathway to citizenship is the &ldquo;moral&rdquo; thing to do.</p><p> </p><p>&quot;Is it moral for us, for example, to take advantage of cheap labor from illegal immigrants while denying them citizenship? I'm sure you can tell from the way I phrased the question that I believe we have taken the moral low road on this issue,&rdquo; he wrote.</p><p> </p><p>Carson has also said the United States should model its immigration reform after Canada&rsquo;s guest-worker program. &ldquo;People already here illegally could apply for guest-worker status from outside of the country,&rdquo; Carson wrote in November. &ldquo;This means they would have to leave first.&rdquo;</p><p> </p><p>In a separate column written that month, Carson took a harder line on the path-to-citizenship issue.</p><p> </p><p>&ldquo;The American people should not be manipulated into believing that they are heartless simply because they want to preserve the rule of law in our nation and look after their own before they take in others,&rdquo; he wrote. &ldquo;We also have to consider the millions of people who have immigrated here legally as well as those who are in the queue. It is incredibly unfair to them to grant amnesty to those who have jumped ahead of them in line illegally.&rdquo;</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>Carson is not on the record at all about issues related to the DREAM Act, and a spokesman did not further clarify his position in a statement to National Journal.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Chris Christie",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p> In 2010, the New Jersey governor was a vocal supporter of a path to citizenship.</p><p> &ldquo;The president and the Congress have to step up to the plate, they have to secure our borders, and they have to put forward a commonsense path to citizenship for people,&rdquo; Christie told CNN&rsquo;s Jake Tapper at the time.</p><p> &ldquo;What I support is making sure that the federal government [plays] each and every one of its roles: securing the border, enforcing immigration laws, and having an orderly process&mdash;whatever that process is&mdash;for people to gain citizenship,&rdquo; Christie also said.</p><p> Since then, however, Christie has backed away from that stance&mdash;or at least refused to reaffirm his support for a path to citizenship. In a 2013 interview with ABC&rsquo;s George Stephanopoulos, he repeatedly dodged questions about it.</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p> In 2013, Christie signed the New Jersey DREAM Act, which granted undocumented students in New Jersey access to in-state tuition rates as long as they attended high school in the United States for three years.</p><p> &ldquo;Our job, I believe, as a government, is to give every one of these children, who we have already invested hundreds of thousands of dollars in, an opportunity to maximize that investment for their own benefit, for the benefit of their families, and for the benefit of our state and our country,&rdquo; Christie said after passing the law.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Scott Walker",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>&ldquo;First, Obama&rsquo;s executive action should be repealed,&rdquo; a spokesperson for Walker told National Journal. &ldquo;After that, we need absolute security at our borders and then we can address fixing our legal immigration system and deal with those here illegally, but amnesty is not the answer.&rdquo;</p><p> In an interview with ABC in February, the Wisconsin governor reiterated that he is not for &ldquo;amnesty,&rdquo; but also does not favor mass deportation.</p><p> &ldquo;I&rsquo;m not an advocate of the plans that have been pushed here in Washington,&rdquo; Walker said. &ldquo;In the end, we need to enforce the laws of the United States, and we need to find a way for people to have a legitimate legal immigration system in this country, and that doesn&rsquo;t mean amnesty.&rdquo;</p><p> In 2013, however, Walker voiced some support for a pathway to citizenship. At the time, the Wausau Daily Herald&rsquo;s editorial board asked Walker if he could &quot;envision a world where, with the right penalties and waiting periods and meet[ing] the requirements, where those people could get citizenship?&quot;</p><p> &quot;Sure,&quot; he said at the time. &ldquo;I think it makes sense.&quot;</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>Walker has stayed above the fray, not commenting on whether he opposes the federal DREAM Act&mdash;something Democratic operatives have tried to seize upon.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "John Kasich",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p> </p><p>In South Carolina on Thursday, the Ohio governor said that while he &ldquo;doesn&rsquo;t like&rdquo; the idea of a pathway to citizenship, he is open to it. &ldquo;I don't want them to have to leave,&rdquo; he said of undocumented immigrants. &ldquo;As to whether you take the final step to citizenship, that's a whole other question. But what I said is, 'I'm not closed to anything.&rsquo;&rdquo;</p><p> </p><p>At the Republican Governors Association conference in November, Kasich voiced a similar opinion. &ldquo;My sense is, I don&rsquo;t like the idea of citizenship when people jump the line,&rdquo; he said. &ldquo;We may have to do it. It may be a laborious and tough process. I would never say you would never do it.&rdquo;</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>Like Walker, Kasich has avoided giving his direct opinion on the federal DREAM Act, though Ohio was among the 25 states that challenged the federal government over Obama&rsquo;s executive actions on immigration.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Rick Perry",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p> While the former Texas governor has been a staunch defender of the DREAM Act in his state, he has been less clear-cut about a general path to citizenship. In 2011, Perry told The Daily Beast he could &ldquo;envision some sort of path to citizenship for people who are here illegally&rdquo; (the interviewer&rsquo;s words, not his). But he didn&rsquo;t all-out support it, either. &quot;We have a pathway to citizenship in this country today: It&rsquo;s get in the line and do what it takes to get here legally,&quot; he said.</p><p> More recently, like many of his fellow Republicans, Perry has narrowed his focus to border security.</p><p> &ldquo;Gov. Perry has long called for an all-of-the-above approach to resources to defend our border, including strategic fencing, boots on the ground, and water and aviation assets, along with swift response teams,&rdquo; a spokesperson for Perry told National Journal. &ldquo;Gov. Perry believes we must secure the border first before addressing immigration reform. After the border is secure, we can have a conversation about how to handle the millions of people already in the U.S. illegally.&rdquo;</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'affirmative'>Yes.</span></p><p>After a 2011 presidential debate, Perry received a considerable amount of conservative blowback for comments he made in support of the Texas DREAM Act, which gave in-state tuition to undocumented students. &ldquo;If you say that we should not educate children who have come into our state for no other reason than they have been brought there by no fault of their own, I don&rsquo;t think you have a heart,&rdquo; Perry said at the time.</p><p> </p><p>It&rsquo;s a decision Perry says he sticks by, four years later.</p><p> </p><p>&ldquo;Because of Washington&rsquo;s absolute failure to put policies into place to secure the border, states had to then make decisions on how we&rsquo;re going to deal with these people,&rdquo; Perry told The Wall Street Journal in January. &ldquo;And we looked at it as, there are two options here: You&rsquo;re either going to send the message that young men and women who ended up in this state, in most cases by no action of their own, they had done the work, they were qualified to go to these Texas institutions of higher learning. And we could either say, &rsquo;You have worked hard, and you&rsquo;re going to pay in-state tuition&mdash;this isn&rsquo;t a subsidy, you&rsquo;re paying the same thing as anyone else&mdash;and you&rsquo;re going to get in line to become an American citizen. That made economic sense to us, considering all of the other options that we had. I still think that in 2001, that was the right decision to make.&rdquo;</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Mike Huckabee",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>Eight years ago, the former Arkansas governor voiced support for a path to citizenship. But more recently, Huckabee has drawn away from that broad support.</p><p> &ldquo;Gov. Mike Huckabee thanks God every day we live in a country that people are trying to break into, instead of break out of,&rdquo; a spokesperson for Huckabee told National Journal. &ldquo;Gov. Huckabee strongly opposes amnesty and government benefits for illegal immigrants who violated our laws and believes that immigration reform should start with repealing Obama&rsquo;s unconstitutional executive orders and securing our border.&rdquo;</p><p>Compare that comment with what Huckabee told The Washington Post in 2006:</p><p>&ldquo;I tend to think that the rational approach is to find a way to give people a pathway to citizenship. You shouldn't ignore the law or ignore those who break it. But by the same token, I think it's a little disingenuous when I hear people say they should experience the full weight of the law in every respect with no pathway, because that's not something we practice in any other area of criminal justice in this country.&rdquo;</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Unclear.</span></p><p>Huckabee has made some recent comments arguing against punishing the children of undocumented immigrants for something they have &ldquo;no control over&rdquo; and hinting that DREAMers should be given a path to citizenship.</p><p> &ldquo;Does he get the scholarship and go on to college so that he can become perhaps a doctor, a lawyer, an accountant, a teacher?&rdquo; Huckabee said at a book-tour stop in January. &ldquo;Or do we say, &rsquo;No son, you&rsquo;re as far as you can go. You need to pick tomatoes.&rsquo;&rdquo;</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Rick Santorum",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'negative'>No.</span></p><p>Along with Cruz, Rick Santorum is a strident opponent of a general pathway to citizenship.</p><p> &ldquo;The idea that there are Republicans in Washington, D.C., who are going to say, 'Well, the rule of law isn't that important, the idea of people coming into this country who have done so illegally and we're going to basically treat them the same as people who came here legally,' is just not going to go over well in a Republican primary,&quot; Santorum told Fox&rsquo;s Andrea Tantaros in 2013.</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'neutral'>Probably not.</span></p><p>Univision asked Santorum in 2012 if he would veto the DREAM Act if it were up to him. &ldquo;Yeah, I would,&rdquo; he said. That does not mean he doesn&rsquo;t support a pathway to citizenship for young undocumented immigrants, but it heavily implies it.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Carly Fiorina",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'negative'>No.</span></p><p>Fiorina, the former CEO of Hewlett-Packard, has recently said that she could envision herself supporting a path to legalization for undocumented immigrants&mdash;much like Ronald Reagan&rsquo;s 1986 immigration overhaul&mdash;but not to full citizenship.</p><p>That is consistent what she has said in the past. &ldquo;I do not support amnesty,&rdquo; she told CNN in 2010.</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'affirmative'>Yes.</span></p><p>When asked in a 2010 debate against Sen. Barbara Boxer if she would support the DREAM Act, Fiorina said she would, while emphasizing her opposition to general amnesty.</p><p> &ldquo;Yes, I would support the DREAM Act, because I do not believe that we can punish children who through no fault of their own are here trying to live the American dream,&rdquo; Fiorina said at the time.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                },
				{
                    "name": "Lindsey Graham",
                    "position": "",
                    "coloring": "",
                    "elaboration": "<p><strong>Should the government offer immigrants already living in the United States illegally a pathway to citizenship?</strong> <span class = 'affirmative'>Yes.</span></p><p>Graham supports a legislative pathway to citizenship, as shown in the Gang of Eight bill he cosponsored&mdash;but like most of his fellow Republicans, he opposes Obama&rsquo;s executive actions on immigration.</p><p><strong>Should the children of undocumented immigrants be offered a pathway to citizenship?</strong> <span class = 'affirmative'>Yes.</span></p><p>Given his support for a general pathway to citizenship for adults, it&rsquo;s not surprising that he supports the same pathway for DREAMers.</p><p>&quot;I don't believe most Americans would fault the Republican Party if we allowed children who have been here since they're babies to assimilate into society with a pathway to citizenship after we secure our borders,&rdquo; Graham told CNN in December.</p>",
                    "quote": {
                        "text": "",
                        "dateline": ""
                    }
                }
                
                
            ]
        }
    ]
};